
&НаКлиенте
АСИНХ Процедура ОбработкаКоманды(ПараметрКоманды, ПараметрыВыполненияКоманды)
	НазваниеТовара = Ждать ВвестиСтрокуАсинх("", "Введите название товара");
	
	Если ПроверитьСуществованиеТовара(НазваниеТовара) Тогда
		ТекстСообщения = СтрШаблон("Товар %1 Найден!", НазваниеТовара);
	Иначе
		ТекстСообщения = СтрШаблон("Товар %1 НЕ Найден!", НазваниеТовара);
	КонецЕсли;
	
	Сообщить(ТекстСообщения);
КонецПроцедуры


Функция ПроверитьСуществованиеТовара(НазваниеТовара)
	
	ТаблицаТовара = Новый ТаблицаЗначений();
	ТаблицаТовара.Колонки.Добавить("Название");
	ТаблицаТовара.Колонки.Добавить("Цена");
	
	СтрокаТовара = ТаблицаТовара.Добавить();
	СтрокаТовара.Название = "мм";
	СтрокаТовара.Цена = "100";
	
	СтрокаТовара = ТаблицаТовара.Добавить();
	СтрокаТовара.Название = "дд";
	СтрокаТовара.Цена = "90";
	
	ТоварСуществует = Справочники.Товары.ПроверитьСуществованиеПоНазванию(НазваниеТовара);
	Возврат ТоварСуществует;
КонецФункции